# PhyMaterialParamThermalConductivityZ Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamThermalConductivityZ Property
ParameterTypeId Class See Also
---
"Thermal Conductivity Z"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamThermalConductivityZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamThermalConductivityZ As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamThermalConductivityZ {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace